app/controllers/countries_controller.rb

  def index
    @month_id = params[:month_id]
    @countries = Month.find(@month_id).countries

    @countries_info=[]
    @countries.each do |country|
---
SELECT  "months".* FROM "months" WHERE "months"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "countries".* FROM "countries" INNER JOIN "countries_months" ON "countries"."id" = "countries_months"."country_id" WHERE "countries_months"."month_id" = $1  [["month_id", 1]]