app/controllers/months_controller.rb

  def index
    @months = Month.all
---
SELECT "months".* FROM "months"